In [16]:
import pandas as pd
import numpy as np

In [3]:
dict1 = {
    "name":["Rahul", "Jaggi", "Billa"],
    "Marks":[50, 90, 60],
    "City":["Delhi", "Chandigarh", "Amritsar"]
}

In [7]:
df = pd.DataFrame(dict1)
df

    name  Marks        City
0  Rahul     50       Delhi
1  Jaggi     90  Chandigarh
2  Billa     60    Amritsar

In [19]:
ser = pd.Series(np.random.rand(10))
ser

0    0.039499
1    0.623040
2    0.363306
3    0.978304
4    0.530160
5    0.382063
6    0.511924
7    0.616277
8    0.514507
9    0.924621
dtype: float64

In [20]:
pd.DataFrame(ser)

          0
0  0.039499
1  0.623040
2  0.363306
3  0.978304
4  0.530160
5  0.382063
6  0.511924
7  0.616277
8  0.514507
9  0.924621